/*
Author: vpetrigo
Task:
ѕо данным числам n и m заполните двумерный массив размером n?m числами от 
1 до n?m по спирали, выход€щей из левого верхнего угла и 
закрученной по часовой стрелке, как показано в примере.

‘ормат входных данных
¬вод€тс€ два числа n и m, не превышающие 100.

‘ормат выходных данных
¬ыведите полученный массив, отвод€ на вывод каждого элемента ровно 4 символа.

Sample Input:
4 5
Sample Output:
1   2   3   4   5
14  15  16  17   6
13  20  19  18   7
12  11  10   9   8

*/

#include <iostream>
#include <iomanip>

using namespace std;

int main() {
    const int size = 100;
    int arr[size][size];
    int n, m;

    cin >> n >> m;



    return 0;
}